sergev/pic32prog/adapter-bitbang.c
    unsigned char buffer[110];  // @@@@@@@@@@ BUFFERED WRITES VERSION @@@@@@@@@@
    int index = 0;              // index of next slot to use in buffer
    int pairs = 0;              // count of number of TDI/TMS pairs
    int count = 0;              // count of the number of symbols used
    int i, n;
    unsigned char ch;

    if (a->BitsToRead != 0)
        fprintf (stderr, "WARNING - write while pending read (in send)\n");
    if (read_flag && (tdi_nbits == 0))
        fprintf (stderr, "WARNING - request to read 0 bits (in send)\n");

    for (i = tms_nbits; i > 0; i--) {           // for each of the n bits...
        ch = (tms & 1) + 'd';                   // d, e, f, g
        buffer [index++] = ch;                  // append to buffer
        tms >>= 1;                              // shift TMS right one bit
    }
    count += tms_nbits;
    pairs += tms_nbits;

    if (DBG1 && (tms_nbits != 0))
        buffer[index++] = '.';                  // spacer, ignored by programmer

    if (tdi_nbits != 0) {                       // 1-0-0 if nTDI <> 0
        if (CFG3) {                             // use compression: edd -> a, edD -> A
            buffer[index++] = (read_flag ? 'A' : 'a');
            count++;
        }
        else {                                  // compression flag turned off
            ch = 1 + 'd';
            buffer[index++] = ch;
            ch = 0 + 'd';
            buffer[index++] = ch;
            ch = 0 + (read_flag ? 'D' : 'd');
            buffer[index++] = ch;
            count += 3;
        }
        pairs += 3;
        if (DBG1)
            buffer[index++] = '.';              // spacer, ignored by programmer
    }

    long long Xtdi = tdi;
    a->CharToRead = (read_flag == 2 ? 1 : 0);
    a->BitsToRead = (read_flag == 2 ? 1 : 0);

    i = tdi_nbits;
    if (CFG3) {                                 // while we can, package up lots of 4 TDI bits
        for (; i > 4; i -= 4) {                 // make sure the last bit is NOT packaged
            ch = (read_flag == 1 ? 'I' : 'i') + (tdi & 0xF);
            buffer[index++] = ch;
            tdi >>= 4;
            count++;
            if (read_flag == 1) a->CharToRead++;
        }
    }
    for (; i > 0; i--) {                        // (send all/remaining bits as singles)
        ch = ((tdi & 1) << 1) + (i == 1) +      // TMS=0 for n-1 bits, then 1 on last bit
             ((read_flag == 1 && i != 1) ?      // 0 = no read, 1 = normal read, 2 = oPrAcc read
              'D' : 'd');                       // UC = read, LC = none, no read on last bit
        buffer[index++] = ch;                   // append to buffer
        tdi >>= 1;                              // shift TDI right one bit
        count++;
        if (read_flag == 1) a->CharToRead++;
    }
    pairs += tdi_nbits;
    if (read_flag == 1) a->BitsToRead = tdi_nbits;


    if (tdi_nbits != 0) {                       // 1-0 if nTDI <> 0
        if (DBG1)
            buffer[index++] = '.';              // spacer, ignored by programmer

        if (CFG3) {
            buffer[index++] ='z';               // use compression: ed -> z
            count++;
        }
        else {                                  // compression flag turned off
            ch = 1 + 'd';
            buffer[index++] = ch;
            ch = 0 + 'd';
            buffer[index++] = ch;
            count += 2;
        }
        pairs += 2;
    }

    //
    // Control handshaking for ICSP programmers
    //

    if (a->PendingHandshake)
    {
        //////// this code is also duplicated in bitbang_send ////////
        if (a->RunningWriteCount > a->MaxBufferedWrites)
            a->MaxBufferedWrites = a->RunningWriteCount;
        a->RunningWriteCount = 0;
        //////////////////////////////////////////////////////////////

        a->PendingHandshake = 0;

        n = serial_read (&ch, 1);
        a->Read2Count++;

        if (n != 1 || ch != '<')
            fprintf (stderr, "WARNING - handshake read error (in send)\n");
    }

    //
    // the below block is to implement handshake on
    // EVERY write that does not have (read_flag != 0)
    //
    if (CFG1 == 1 && !read_flag)
    {
        buffer[index++] = '>';
        a->PendingHandshake = 1;
    }

    //
    // this block is to implement handshake on every 900/440 (MAXW) characters
    // NOTE: assumes the Rx buffer in the programmer is 1024/512 bytes long
    //                                                  **************

    if (CFG1 == 2 && !read_flag && (a->RunningWriteCount + index) > MAXW)   // 900 + 50 < 1024
    {                                                                       // 440 + 30 < 512
        buffer[index++] = '>';
        a->PendingHandshake = 1;
    }

    //
    // end of handshaking code
    //

    buffer[index] = 0;          // append trailing zero so can print as a string

    a->RunningWriteCount += index;               // number of characters being written
    a->TotalBitPairsSent += pairs;               // number of TDI/TMS pairs encoded
    a->TotalCodeChrsSent += count;               // number of symbols used to send pairs

    if (DBG1) {
        unsigned L4 = Xtdi >> 48;
        unsigned L3 = (Xtdi >> 32) & 0xFFFF;
        unsigned L2 = (Xtdi >> 16) & 0xFFFF;
        unsigned L1 = Xtdi & 0xFFFF;
        printf ("n=%i, <%s> read=%i TDI: %04x %04x %04x %04x\n",
                index, buffer, read_flag, L4,  L3,  L2,  L1);
    }

    serial_write (buffer, index);
    a->WriteCount++;
}

/*
 * (by RR)
 */
static unsigned long long bitbang_recv (bitbang_adapter_t *a)
{
    unsigned char buffer[70];
    unsigned long long word;
    int n, i;

    //////// this code is also duplicated in bitbang_send ////////
    if (a->RunningWriteCount > a->MaxBufferedWrites)
        a->MaxBufferedWrites = a->RunningWriteCount;
    a->RunningWriteCount = 0;
    //////////////////////////////////////////////////////////////

    if (a->PendingHandshake)
        fprintf (stderr, "WARNING - handshake pending error (in recv)\n");

