sergev/pic32prog/adapter-bitbang.c
    int expected = (CFG4 ? a->CharToRead : a->BitsToRead);

    n = serial_read (buffer, expected);
    a->TotalCodeChrsRecv += n;
    a->Read1Count++;
    buffer[n] = 0;              // append trailing zero so can print as a string

    if (n != expected)
        fprintf (stderr,
            "WARNING - fewer characters read (%i) than expected (%i) (in recv)\n",
                                              n,              expected);

    word = 0;

    for (i = n-1; i >=0; i--) {

        if ((buffer[i] >= 'I') && (buffer[i] <= 'X'))
            word = (word << 4) | (buffer[i] - 'I');
        else {
            switch (buffer[i]) {
                case ('0'):
                    word = (word << 1) | 0;
                break;
                case ('1'):
                    word = (word << 1) | 1;
                break;

                default:fprintf (stderr,
                        "WARNING - unexpected character (0x%02x) returned (in recv)\n",
                                                       buffer[i]);
            }  // switch
        }  // if ... else
    }  // for loop

    if (DBG1) {
        unsigned L4 = word >> 48;
        unsigned L3 = (word >> 32) & 0xFFFF;
        unsigned L2 = (word >> 16) & 0xFFFF;
        unsigned L1 = word & 0xFFFF;
        printf ("TDO = %04x %04x %04x %04x (%i bits) <%s>\n",
                        L4,  L3,  L2,  L1, a->BitsToRead, buffer);
    }

    a->TotalBitsReceived += a->BitsToRead;
    a->BitsToRead = 0;
    return word;
}

/*
 * this routine performs the functions:
 * (1) power up the target, then send out the ICSP signature to enable ICSP programming mode;
 * (0) power down the target in an orderly fashion.
 * (by RR)
 */
static void bitbang_ICSP_enable (bitbang_adapter_t *a, int ICSP_EN)
{
    if (ICSP_EN)
    {
        // 50mS delay after powerup, pulse MCLR high, send signature, set MCLR high, 10mS delay
        unsigned char buffer[64] = "5.88888.32.8.0100.1101.0100.0011.0100.1000.0101.0000.8.3.8......";
                                 // 0000000001111111111222222222233333333334444444444555555555566666
                                 // 1234567890123456789012345678901234567890123456789012345678901234

        serial_write (buffer, 64);
        usleep (150000);    // 150mS delay to allow the above to percolate through the system
    }
    else
    {
        // 50mS delay then cut power
        unsigned char buffer[16] = "88888.4.........";
                                 // 0000000001111111
                                 // 1234567890123456

        serial_write (buffer, 16);

        // 100mS delay to allow the above to percolate through the system
        usleep (100000);
    }
}

static void bitbang_close (adapter_t *adapter, int power_on)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;

    usleep (100000);

    /* Clear EJTAGBOOT mode. */
    bitbang_send (a, 1, 1, 5, TAP_SW_ETAP, 0);    /* Send command. */
    bitbang_send (a, 6, 31, 0, 0, 0);             /* TMS 1-1-1-1-1-0 */
    // (force the Chip TAP controller into Run Test/Idle state)

    //
    // not entirely sure the above sequence is correct.
    // see pg 29 of microchip programming docs
    //

    bitbang_ICSP_enable (a, 0);
    gettimeofday (&a->T2, 0);

    printf ("\n");
    printf ("total TDI/TMS pairs sent = %i pairs\n", a->TotalBitPairsSent);
    printf ("total TDO bits received  = %i bits\n",  a->TotalBitsReceived);

    printf ("total ascii codes sent   = %i\n", a->TotalCodeChrsSent);
    printf ("total ascii codes recv   = %i\n", a->TotalCodeChrsRecv);
    printf ("maximum continuous write = %i chars\n", a->MaxBufferedWrites);

    printf ("O/S serial writes        = %i\n", a->WriteCount);
    printf ("O/S serial reads (data)  = %i\n", a->Read1Count);
    printf ("O/S serial reads (sync)  = %i\n", a->Read2Count);
    printf ("XferFastData count       = %i\n", a->FDataCount);
    printf ("10mS delays (E/X/R)      = %i/%i/%i\n", a->DelayCount[0],
                                                     a->DelayCount[1],
                                                     a->DelayCount[2]);
    printf ("elapsed programming time = %lum %02lus\n", (a->T2.tv_sec - a->T1.tv_sec) / 60,
                                                        (a->T2.tv_sec - a->T1.tv_sec) % 60);

    serial_close();                    // at this point we are exiting application???
//  free (a);                          // suspect this line was causing XP CRASHES
                                       // - shouldn't be needed anyway
}

/*
 * Read the Device Identification code
 */
static unsigned bitbang_get_idcode (adapter_t *adapter)
{
    bitbang_adapter_t *a = (bitbang_adapter_t*) adapter;
    unsigned idcode;

    if (DBG2)
        fprintf (stderr, "get_idcode\n");

    /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
     * After reset, the IDCODE register is always selected.
     * Read out 32 bits of data. */
    bitbang_send (a, 6, 31, 32, 0, 1);
    idcode = bitbang_recv (a);
    return idcode;
}

/*
 * Put device in serial execution mode. This is an alternative version
 * taken directly from the microchip application note. The original
 * version threw up a status error and then did an exit(-1), but
 * when the exit was commented out still seemed to function.
 * SEE: "PIC32 Flash Programming Specification 60001145N.pdf"
 * (by RR)
 */
static void serial_execution (bitbang_adapter_t *a)
{
    if (DBG2)
        fprintf (stderr, "serial_execution\n");

    if (a->serial_execution_mode)
        return;
    a->serial_execution_mode = 1;

    /* Enter serial execution. */
    if (debug_level > 0)
        fprintf (stderr, "enter serial execution\n");

    bitbang_send (a, 1, 1, 5, TAP_SW_MTAP, 0);    /* Send command. */             // 1.
    bitbang_send (a, 1, 1, 5, MTAP_COMMAND, 0);   /* Send command. */             // 2.
    bitbang_send (a, 0, 0, 8, MCHP_STATUS, 1);    /* Xfer data. */                // 3.
    unsigned status = bitbang_recv (a);
    if (debug_level > 0)
        fprintf (stderr, "status %04x\n", status);
    if ((status & MCHP_STATUS_CPS) == 0) {
        fprintf (stderr, "invalid status = %04x (code protection)\n", status);    // 4.
        exit (-1);
    }

    bitbang_send (a, 0, 0, 8, MCHP_ASSERT_RST, 0);  /* Xfer data. */              // 5.

    bitbang_send (a, 1, 1, 5, TAP_SW_ETAP, 0);    /* Send command. */             // 6.
    bitbang_send (a, 1, 1, 5, ETAP_EJTAGBOOT, 0); /* Send command. */             // 7.


    bitbang_send (a, 1, 1, 5, TAP_SW_MTAP, 0);    /* Send command. */             // 8.
    bitbang_send (a, 1, 1, 5, MTAP_COMMAND, 0);   /* Send command. */             // 9.
    bitbang_send (a, 0, 0, 8, MCHP_DEASSERT_RST, 0);  /* Xfer data. */            // 10.

    if (memcmp(a->adapter.family_name, "mz", 2) != 0)     // not needed for MZ processors
        bitbang_send (a, 0, 0, 8, MCHP_FLASH_ENABLE, 0);  /* Xfer data. */        // 11.

    bitbang_send (a, 1, 1, 5, TAP_SW_ETAP, 0);    /* Send command. */             // 12.
}

//
// Shouldn't XferFastData check the value of PrAcc returned in
// the LSB? We don't seem to be even reading this back.
// UPDATE1: The check is not needed in 4-wire JTAG mode, seems
// to only be required if in 2-wire ICSP mode. It would also
// slow us down horribly.
// UPDATE2: We are operating at such a slow speed that the PrAcc
// check is not really needed. To date, have never seen PrAcc != 1
//
static void xfer_fastdata (bitbang_adapter_t *a, unsigned word)
{
    a->FDataCount++;

    if (CFG2 == 1)
        bitbang_send (a, 0, 0, 33, (unsigned long long) word << 1, 0);

